### Report for environment: ndr-dev

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- access-audit-alarm in modules/lambda_alarms
- access-audit-alarm-topic in modules/sns
- access-audit-gateway in modules/gateway
- access-audit-lambda in modules/lambda
- access_audit_dynamodb_table in modules/dynamo_db
- alarm_state_history_table in modules/dynamo_db
- api_endpoint_url_ssm_parameter in modules/ssm_parameter
- auth_session_dynamodb_table in modules/dynamo_db
- auth_state_dynamodb_table in modules/dynamo_db
- authoriser-alarm in modules/lambda_alarms
- authoriser-alarm-topic in modules/sns
- authoriser-lambda in modules/lambda
- back-channel-logout-gateway in modules/gateway
- back_channel_logout_alarm in modules/lambda_alarms
- back_channel_logout_alarm_topic in modules/sns
- back_channel_logout_lambda in modules/lambda
- bulk-upload-alarm in modules/lambda_alarms
- bulk-upload-alarm-topic in modules/sns
- bulk-upload-lambda in modules/lambda
- bulk-upload-metadata-alarm in modules/lambda_alarms
- bulk-upload-metadata-alarm-topic in modules/sns
- bulk-upload-metadata-lambda in modules/lambda
- bulk-upload-report-alarm in modules/lambda_alarms
- bulk-upload-report-alarm-topic in modules/sns
- bulk-upload-report-lambda in modules/lambda
- bulk_upload_metadata_preprocessor_lambda in modules/lambda
- bulk_upload_report_dynamodb_table in modules/dynamo_db
Downloading registry.terraform.io/cloudstoragesec/cloud-storage-security/aws 1.8.8+css9.02.000 for cloud_storage_security...
- cloud_storage_security in .terraform/modules/cloud_storage_security
- cloudfront-distribution-lg in modules/cloudfront
- cloudfront_edge_dynamodb_table in modules/dynamo_db
- cloudfront_firewall_waf_v2 in modules/firewall_waf_v2
- create-doc-ref-lambda in modules/lambda
- create-token-gateway in modules/gateway
- create-token-lambda in modules/lambda
- create_doc_alarm in modules/lambda_alarms
- create_doc_alarm_topic in modules/sns
- create_document_reference_gateway in modules/gateway
- create_token-alarm in modules/lambda_alarms
- create_token-alarm_topic in modules/sns
- data-collection-alarm in modules/lambda_alarms
- data-collection-alarm-topic in modules/sns
- data-collection-lambda in modules/lambda
- delete-doc-ref-gateway in modules/gateway
- delete-doc-ref-lambda in modules/lambda
- delete-document-object-alarm in modules/lambda_alarms
- delete-document-object-alarm-topic in modules/sns
- delete-document-object-lambda in modules/lambda
- delete_doc_alarm in modules/lambda_alarms
- delete_doc_alarm_topic in modules/sns
- document-manifest-job-gateway in modules/gateway
- document-manifest-job-lambda in modules/lambda
- document-status-check-alarm in modules/lambda_alarms
- document-status-check-alarm-topic in modules/sns
- document-status-check-gateway in modules/gateway
- document-status-check-lambda in modules/lambda
- document_manifest_alarm in modules/lambda_alarms
- document_manifest_alarm_topic in modules/sns
- document_reference_dynamodb_table in modules/dynamo_db
- document_upload_check_lambda in modules/lambda
- edge-presign-lambda in modules/lambda_edge
- edge_presign_alarm in modules/lambda_alarms
- edge_presign_alarm_topic in modules/sns
- feature-flags-gateway in modules/gateway
- feature-flags-lambda in modules/lambda
- feature_flags_alarm in modules/lambda_alarms
- feature_flags_alarm_topic in modules/sns
- fhir_document_reference_gateway in modules/gateway
- firewall_waf_v2 in modules/firewall_waf_v2
- firewall_waf_v2_api in modules/firewall_waf_v2
- generate-document-manifest-alarm in modules/lambda_alarms
- generate-document-manifest-alarm-topic in modules/sns
- generate-document-manifest-lambda in modules/lambda
- generate-lloyd-george-stitch-alarm in modules/lambda_alarms
- generate-lloyd-george-stitch-alarm-topic in modules/sns
- generate-lloyd-george-stitch-lambda in modules/lambda
- get-doc-fhir-lambda in modules/lambda
- get-report-by-ods-alarm in modules/lambda_alarms
- get-report-by-ods-alarm-topic in modules/sns
- get-report-by-ods-gateway in modules/gateway
- get-report-by-ods-lambda in modules/lambda
- global_sqs_age_alarm_topic in modules/sns
- im-alerting-lambda in modules/lambda
- lambda-layer-alerting in modules/lambda_layers
- lambda-layer-core in modules/lambda_layers
- lambda-layer-data in modules/lambda_layers
- lambda-layer-reports in modules/lambda_layers
- lloyd-george-stitch-gateway in modules/gateway
- lloyd-george-stitch-lambda in modules/lambda
- lloyd-george-stitch_alarm in modules/lambda_alarms
- lloyd-george-stitch_topic in modules/sns
- lloyd_george_reference_dynamodb_table in modules/dynamo_db
- login_redirect-alarm_topic in modules/sns
- login_redirect_alarm in modules/lambda_alarms
- login_redirect_lambda in modules/lambda
- logout-gateway in modules/gateway
- logout_alarm in modules/lambda_alarms
- logout_alarm_topic in modules/sns
- logout_lambda in modules/lambda
- manage-nrl-pointer-alarm in modules/lambda_alarms
- manage-nrl-pointer-alarm-topic in modules/sns
- manage-nrl-pointer-lambda in modules/lambda
- mns-dlq-alarm-topic in modules/sns
- mns-notification-alarm in modules/lambda_alarms
- mns-notification-alarm-topic in modules/sns
- mns-notification-lambda in modules/lambda
- mns_encryption_key in modules/kms
- ndr-app-config in modules/app_config
- ndr-bulk-staging-store in modules/s3
- ndr-docker-ecr-data-collection in modules/ecr
- ndr-docker-ecr-ui in modules/ecr
- ndr-document-store in modules/s3
- ndr-ecs-container-port-ssm-parameter in modules/ssm_parameter
- ndr-ecs-fargate-app in modules/ecs
- ndr-ecs-fargate-data-collection in modules/ecs
- ndr-feedback-mailbox in modules/ses
- ndr-lloyd-george-store in modules/s3
- ndr-truststore in modules/s3
- ndr-vpc-ui in modules/vpc
- ndr-zip-request-store in modules/s3
- nhs-oauth-token-generator-alarm in modules/lambda_alarms
- nhs-oauth-token-generator-alarm-topic in modules/sns
- nhs-oauth-token-generator-lambda in modules/lambda
- nrl-dlq-alarm-topic in modules/sns
- pdf-stitching-alarm-topic in modules/sns
- pdf-stitching-lambda in modules/lambda
- pdf-stitching-lambda-alarms in modules/lambda_alarms
- pdm-document-store in modules/s3
- pdm_dynamodb_table in modules/dynamo_db
- post-document-references-fhir-lambda in modules/lambda
- route53_fargate_ui in modules/route53
- search-document-references-fhir-lambda in modules/lambda
- search-document-references-gateway in modules/gateway
- search-document-references-lambda in modules/lambda
- search-patient-details-gateway in modules/gateway
- search-patient-details-lambda in modules/lambda
- search_doc_alarm in modules/lambda_alarms
- search_doc_alarm_topic in modules/sns
- search_patient_alarm in modules/lambda_alarms
- search_patient_alarm_topic in modules/sns
- send-feedback-alarm in modules/lambda_alarms
- send-feedback-alarm-topic in modules/sns
- send-feedback-gateway in modules/gateway
- send-feedback-lambda in modules/lambda
- sns_encryption_key in modules/kms
- sqs-lg-bulk-upload-invalid-queue in modules/sqs
- sqs-lg-bulk-upload-metadata-queue in modules/sqs
- sqs-mns-notification-queue in modules/sqs
- sqs-nrl-queue in modules/sqs
- sqs-stitching-queue in modules/sqs
- sqs_alarm_lambda_topic in modules/sns
- statistical-report-alarm in modules/lambda_alarms
- statistical-report-alarm-topic in modules/sns
- statistical-report-lambda in modules/lambda
- statistical-reports-store in modules/s3
- statistics_dynamodb_table in modules/dynamo_db
- stitch_metadata_reference_dynamodb_table in modules/dynamo_db
- stitching-dlq-alarm-topic in modules/sns
- toggle-bulk-upload-lambda in modules/lambda
- unstitched_lloyd_george_reference_dynamodb_table in modules/dynamo_db
- update-upload-state-gateway in modules/gateway
- update-upload-state-lambda in modules/lambda
- update_upload_state_alarm in modules/lambda_alarms
- update_upload_state_alarm_topic in modules/sns
- virus_scan_result_alarm in modules/lambda_alarms
- virus_scan_result_alarm_topic in modules/sns
- virus_scan_result_gateway in modules/gateway
- virus_scan_result_lambda in modules/lambda
- zip_store_reference_dynamodb_table in modules/dynamo_db
Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding hashicorp/awscc versions matching ">= 0.72.1, ~> 1.0"...
- Finding hashicorp/aws versions matching ">= 4.0.0, ~> 5.0"...
- Finding latest version of hashicorp/archive...
- Finding latest version of hashicorp/random...
- Finding latest version of hashicorp/time...
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)
- Installing hashicorp/time v0.13.1...
- Installed hashicorp/time v0.13.1 (signed by HashiCorp)
- Installing hashicorp/awscc v1.55.0...
- Installed hashicorp/awscc v1.55.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (10 to add, 7 to change, 22 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.ndr_api_deploy must be replaced
+/- resource "aws_api_gateway_deployment" "ndr_api_deploy" {
      ~ created_date  = "2025-09-04T07:58:20Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ccy0v3rve9/" -> (known after apply)
      ~ id            = "yt4ssu" -> (known after apply)
      ~ invoke_url    = "[REDACTED_API_GATEWAY_URL]" -> (known after apply)
      ~ variables     = {
          - "deployed_at" = "2025-09-04T07:58:19Z"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.get_document_reference will be updated in-place
  ~ resource "aws_api_gateway_resource" "get_document_reference" {
        id          = "mw3mmq"
      ~ parent_id   = "hh83vc" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.ndr_api will be updated in-place
  ~ resource "aws_api_gateway_stage" "ndr_api" {
      ~ deployment_id         = "yt4ssu" -> (known after apply)
        id                    = "ags-ccy0v3rve9-dev"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # module.fhir_document_reference_gateway.aws_api_gateway_integration.preflight_integration will be destroyed
  # (because module.fhir_document_reference_gateway is not in configuration)
  - resource "aws_api_gateway_integration" "preflight_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "hh83vc" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-ccy0v3rve9-hh83vc-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = jsonencode(
                {
                  - statusCode = 200
                }
            )
        } -> null
      - resource_id             = "hh83vc" -> null
      - rest_api_id             = "ccy0v3rve9" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.fhir_document_reference_gateway.aws_api_gateway_integration_response.preflight_integration_response will be destroyed
  # (because module.fhir_document_reference_gateway is not in configuration)
  - resource "aws_api_gateway_integration_response" "preflight_integration_response" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-ccy0v3rve9-hh83vc-OPTIONS-200" -> null
      - resource_id         = "hh83vc" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Credentials" = "'true'"
          - "method.response.header.Access-Control-Allow-Headers"     = "'Content-Type,X-Amz-Date,Authorization,X-Auth,Cookie,X-Api-Key,X-Amz-Security-Token,X-Auth-Cookie,Accept'"
          - "method.response.header.Access-Control-Allow-Methods"     = "'POST, GET'"
          - "method.response.header.Access-Control-Allow-Origin"      = "'*'"
        } -> null
      - response_templates  = {} -> null
      - rest_api_id         = "ccy0v3rve9" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.fhir_document_reference_gateway.aws_api_gateway_method.preflight_method will be destroyed
  # (because module.fhir_document_reference_gateway is not in configuration)
  - resource "aws_api_gateway_method" "preflight_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-ccy0v3rve9-hh83vc-OPTIONS" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "hh83vc" -> null
      - rest_api_id          = "ccy0v3rve9" -> null
        # (3 unchanged attributes hidden)
    }

  # module.fhir_document_reference_gateway.aws_api_gateway_method.proxy_method["GET"] will be destroyed
  # (because module.fhir_document_reference_gateway is not in configuration)
  - resource "aws_api_gateway_method" "proxy_method" {
      - api_key_required     = true -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-ccy0v3rve9-hh83vc-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "hh83vc" -> null
      - rest_api_id          = "ccy0v3rve9" -> null
        # (3 unchanged attributes hidden)
    }

  # module.fhir_document_reference_gateway.aws_api_gateway_method.proxy_method["POST"] will be destroyed
  # (because module.fhir_document_reference_gateway is not in configuration)
  - resource "aws_api_gateway_method" "proxy_method" {
      - api_key_required     = true -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-ccy0v3rve9-hh83vc-POST" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "hh83vc" -> null
      - rest_api_id          = "ccy0v3rve9" -> null
        # (3 unchanged attributes hidden)
    }

  # module.fhir_document_reference_gateway.aws_api_gateway_method_response.preflight_method_response will be destroyed
  # (because module.fhir_document_reference_gateway is not in configuration)
  - resource "aws_api_gateway_method_response" "preflight_method_response" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-ccy0v3rve9-hh83vc-OPTIONS-200" -> null
      - resource_id         = "hh83vc" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Credentials" = true
          - "method.response.header.Access-Control-Allow-Headers"     = true
          - "method.response.header.Access-Control-Allow-Methods"     = true
          - "method.response.header.Access-Control-Allow-Origin"      = true
        } -> null
      - rest_api_id         = "ccy0v3rve9" -> null
      - status_code         = "200" -> null
    }

  # module.fhir_document_reference_gateway.aws_api_gateway_resource.gateway_resource will be destroyed
  # (because module.fhir_document_reference_gateway is not in configuration)
  - resource "aws_api_gateway_resource" "gateway_resource" {
      - id          = "hh83vc" -> null
      - parent_id   = "1lozellmb1" -> null
      - path        = "/FhirDocumentReference" -> null
      - path_part   = "FhirDocumentReference" -> null
      - rest_api_id = "ccy0v3rve9" -> null
    }

  # module.fhir_document_reference_gateway[0].aws_api_gateway_integration.preflight_integration will be created
  + resource "aws_api_gateway_integration" "preflight_integration" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "ccy0v3rve9"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.fhir_document_reference_gateway[0].aws_api_gateway_integration_response.preflight_integration_response will be created
  + resource "aws_api_gateway_integration_response" "preflight_integration_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Credentials" = "'true'"
          + "method.response.header.Access-Control-Allow-Headers"     = "'Content-Type,X-Amz-Date,Authorization,X-Auth,Cookie,X-Api-Key,X-Amz-Security-Token,X-Auth-Cookie,Accept'"
          + "method.response.header.Access-Control-Allow-Methods"     = "'POST, GET'"
          + "method.response.header.Access-Control-Allow-Origin"      = "'*'"
        }
      + rest_api_id         = "ccy0v3rve9"
      + status_code         = "200"
    }

  # module.fhir_document_reference_gateway[0].aws_api_gateway_method.preflight_method will be created
  + resource "aws_api_gateway_method" "preflight_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "ccy0v3rve9"
    }

  # module.fhir_document_reference_gateway[0].aws_api_gateway_method.proxy_method["GET"] will be created
  + resource "aws_api_gateway_method" "proxy_method" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "ccy0v3rve9"
        # (1 unchanged attribute hidden)
    }

  # module.fhir_document_reference_gateway[0].aws_api_gateway_method.proxy_method["POST"] will be created
  + resource "aws_api_gateway_method" "proxy_method" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "ccy0v3rve9"
        # (1 unchanged attribute hidden)
    }

  # module.fhir_document_reference_gateway[0].aws_api_gateway_method_response.preflight_method_response will be created
  + resource "aws_api_gateway_method_response" "preflight_method_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Credentials" = true
          + "method.response.header.Access-Control-Allow-Headers"     = true
          + "method.response.header.Access-Control-Allow-Methods"     = true
          + "method.response.header.Access-Control-Allow-Origin"      = true
        }
      + rest_api_id         = "ccy0v3rve9"
      + status_code         = "200"
    }

  # module.fhir_document_reference_gateway[0].aws_api_gateway_resource.gateway_resource will be created
  + resource "aws_api_gateway_resource" "gateway_resource" {
      + id          = (known after apply)
      + parent_id   = "1lozellmb1"
      + path        = (known after apply)
      + path_part   = "FhirDocumentReference"
      + rest_api_id = "ccy0v3rve9"
    }

  # module.get-doc-fhir-lambda.data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "placeholder_lambda_payload.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "placeholder_lambda.py"
      + type                = "zip"
    }

  # module.get-doc-fhir-lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.get-doc-fhir-lambda.data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.get-doc-fhir-lambda.data.aws_iam_policy_document.lambda_kms_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_kms_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/79756dcb-72fa-4439-a67d-552061b78f63",
            ]
        }
    }

  # module.get-doc-fhir-lambda.data.aws_iam_policy_document.merged_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "merged_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "appconfig:StartConfigurationSession",
                              + "appconfig:GetLatestConfiguration",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:appconfig:*:*:application/cbe8t8t/environment/w3zulwr/configuration/tsaegbq"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:Scan",
                              + "dynamodb:Query",
                              + "dynamodb:GetItem",
                              + "dynamodb:BatchGetItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_LloydGeorgeReferenceMetadata"
                        },
                      + {
                          + Action   = "dynamodb:Query"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_LloydGeorgeReferenceMetadata/index/FileLocationsIndex"
                        },
                      + {
                          + Action   = "dynamodb:Query"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_LloydGeorgeReferenceMetadata/index/NhsNumberIndex"
                        },
                      + {
                          + Action   = "dynamodb:Query"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_LloydGeorgeReferenceMetadata/index/OdsCodeIndex"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:GetParameter",
                              + "ssm:GetParameters",
                              + "ssm:PutParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ssm:*:*:parameter/*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:List*",
                              + "s3:Get*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::ndr-dev-lloyd-george-store/*",
                              + "arn:aws:s3:::ndr-dev-lloyd-george-store",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.get-doc-fhir-lambda.data.aws_iam_policy_document.root_kms_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "root_kms_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowRootAccountAccess"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowLambdaExecutionRole"

          + principals {
              + identifiers = [
                  + "[REDACTED_IAM_ROLE_ARN]",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.get-doc-fhir-lambda.aws_iam_policy.combined_policies will be updated in-place
  ~ resource "aws_iam_policy" "combined_policies" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_GetDocumentReference_combined_policy"
        name             = "ndr-dev_GetDocumentReference_combined_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "appconfig:StartConfigurationSession",
                          - "appconfig:GetLatestConfiguration",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:appconfig:*:*:application/cbe8t8t/environment/w3zulwr/configuration/tsaegbq"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_LloydGeorgeReferenceMetadata"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_LloydGeorgeReferenceMetadata/index/FileLocationsIndex"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_LloydGeorgeReferenceMetadata/index/NhsNumberIndex"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_LloydGeorgeReferenceMetadata/index/OdsCodeIndex"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                          - "ssm:PutParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:*:*:parameter/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:List*",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::ndr-dev-lloyd-george-store/*",
                          - "arn:aws:s3:::ndr-dev-lloyd-george-store",
                        ]
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/79756dcb-72fa-4439-a67d-552061b78f63"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.get-doc-fhir-lambda.aws_iam_role.lambda_execution_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_execution_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ndr-dev_lambda_execution_role_GetDocumentReference"
        name                  = "ndr-dev_lambda_execution_role_GetDocumentReference"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.get-doc-fhir-lambda.aws_iam_role_policy.lambda_kms_access will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_kms_access" {
        id          = "ndr-dev_lambda_execution_role_GetDocumentReference:lambda_kms_usage"
        name        = "lambda_kms_usage"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/79756dcb-72fa-4439-a67d-552061b78f63"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.get-doc-fhir-lambda.aws_kms_key.lambda will be updated in-place
  ~ resource "aws_kms_key" "lambda" {
        id                                 = "79756dcb-72fa-4439-a67d-552061b78f63"
      ~ policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:root"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowRootAccountAccess"
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "[REDACTED_IAM_ROLE_ARN]"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowLambdaExecutionRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags                               = {}
        # (14 unchanged attributes hidden)
    }

  # module.get-doc-fhir-lambda[0].aws_api_gateway_integration.lambda_integration["0"] will be destroyed
  # (because module.get-doc-fhir-lambda[0] is not in configuration)
  - resource "aws_api_gateway_integration" "lambda_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "mw3mmq" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-ccy0v3rve9-mw3mmq-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "mw3mmq" -> null
      - rest_api_id             = "ccy0v3rve9" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_GetDocumentReference/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.get-doc-fhir-lambda[0].aws_iam_role_policy.lambda_kms_access will be destroyed
  # (because module.get-doc-fhir-lambda[0] is not in configuration)
  - resource "aws_iam_role_policy" "lambda_kms_access" {
      - id          = "ndr-dev_lambda_execution_role_GetDocumentReference:lambda_kms_usage" -> null
      - name        = "lambda_kms_usage" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/79756dcb-72fa-4439-a67d-552061b78f63"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "ndr-dev_lambda_execution_role_GetDocumentReference" -> null
        # (1 unchanged attribute hidden)
    }

  # module.get-doc-fhir-lambda[0].aws_iam_role_policy_attachment.default_policies["arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"] will be destroyed
  # (because module.get-doc-fhir-lambda[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "default_policies" {
      - id         = "ndr-dev_lambda_execution_role_GetDocumentReference-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]08" -> null
      - policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy" -> null
      - role       = "ndr-dev_lambda_execution_role_GetDocumentReference" -> null
    }

  # module.get-doc-fhir-lambda[0].aws_iam_role_policy_attachment.default_policies["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"] will be destroyed
  # (because module.get-doc-fhir-lambda[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "default_policies" {
      - id         = "ndr-dev_lambda_execution_role_GetDocumentReference-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]07" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "ndr-dev_lambda_execution_role_GetDocumentReference" -> null
    }

  # module.get-doc-fhir-lambda[0].aws_iam_role_policy_attachment.lambda_execution_policy will be destroyed
  # (because module.get-doc-fhir-lambda[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      - id         = "ndr-dev_lambda_execution_role_GetDocumentReference-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]06" -> null
      - policy_arn = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_GetDocumentReference_combined_policy" -> null
      - role       = "ndr-dev_lambda_execution_role_GetDocumentReference" -> null
    }

  # module.get-doc-fhir-lambda[0].aws_kms_key.lambda will be destroyed
  # (because module.get-doc-fhir-lambda[0] is not in configuration)
  - resource "aws_kms_key" "lambda" {
      - arn                                = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/fb5c7df7-8236-4ba3-8815-e48c7564bd57" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days            = 7 -> null
      - description                        = "Custom KMS Key for ndr-dev_GetDocumentReference" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "fb5c7df7-8236-4ba3-8815-e48c7564bd57" -> null
      - is_enabled                         = true -> null
      - key_id                             = "fb5c7df7-8236-4ba3-8815-e48c7564bd57" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:root"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowRootAccountAccess"
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "[REDACTED_IAM_ROLE_ARN]"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowLambdaExecutionRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - rotation_period_in_days            = 365 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Environment" = "dev"
          - "Owner"       = "nhse/ndr-team"
          - "Workspace"   = "ndr-dev"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.ndr-vpc-ui.aws_default_security_group.default will be updated in-place
  ~ resource "aws_default_security_group" "default" {
        id                     = "sg-0fe47dbae983fc363"
        name                   = "default"
      ~ tags                   = {
          - "Workspace" = "NDR-205" -> null
        }
      ~ tags_all               = {
          ~ "Workspace"   = "NDR-205" -> "ndr-dev"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.post-document-references-fhir-lambda.aws_api_gateway_integration.lambda_integration["0"] must be replaced
+/- resource "aws_api_gateway_integration" "lambda_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "hh83vc" -> (known after apply)
      ~ id                      = "agi-ccy0v3rve9-hh83vc-POST" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "hh83vc" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.post-document-references-fhir-lambda[0].aws_api_gateway_integration.lambda_integration["0"] will be destroyed
  # (because module.post-document-references-fhir-lambda[0] is not in configuration)
  - resource "aws_api_gateway_integration" "lambda_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "hh83vc" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-ccy0v3rve9-hh83vc-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "hh83vc" -> null
      - rest_api_id             = "ccy0v3rve9" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_PostDocumentReferencesFHIR/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.post-document-references-fhir-lambda[0].aws_iam_role_policy.lambda_kms_access will be destroyed
  # (because module.post-document-references-fhir-lambda[0] is not in configuration)
  - resource "aws_iam_role_policy" "lambda_kms_access" {
      - id          = "ndr-dev_lambda_execution_role_PostDocumentReferencesFHIR:lambda_kms_usage" -> null
      - name        = "lambda_kms_usage" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/37e1841e-d028-4b6b-a521-8bc0fc2edc38"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "ndr-dev_lambda_execution_role_PostDocumentReferencesFHIR" -> null
        # (1 unchanged attribute hidden)
    }

  # module.post-document-references-fhir-lambda[0].aws_iam_role_policy_attachment.default_policies["arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"] will be destroyed
  # (because module.post-document-references-fhir-lambda[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "default_policies" {
      - id         = "ndr-dev_lambda_execution_role_PostDocumentReferencesFHIR-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]03" -> null
      - policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy" -> null
      - role       = "ndr-dev_lambda_execution_role_PostDocumentReferencesFHIR" -> null
    }

  # module.post-document-references-fhir-lambda[0].aws_iam_role_policy_attachment.default_policies["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"] will be destroyed
  # (because module.post-document-references-fhir-lambda[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "default_policies" {
      - id         = "ndr-dev_lambda_execution_role_PostDocumentReferencesFHIR-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]02" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "ndr-dev_lambda_execution_role_PostDocumentReferencesFHIR" -> null
    }

  # module.post-document-references-fhir-lambda[0].aws_iam_role_policy_attachment.lambda_execution_policy will be destroyed
  # (because module.post-document-references-fhir-lambda[0] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      - id         = "ndr-dev_lambda_execution_role_PostDocumentReferencesFHIR-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]01" -> null
      - policy_arn = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_PostDocumentReferencesFHIR_combined_policy" -> null
      - role       = "ndr-dev_lambda_execution_role_PostDocumentReferencesFHIR" -> null
    }

  # module.post-document-references-fhir-lambda[0].aws_kms_key.lambda will be destroyed
  # (because module.post-document-references-fhir-lambda[0] is not in configuration)
  - resource "aws_kms_key" "lambda" {
      - arn                                = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/02fc5ef7-5064-451a-8cdd-3b7e836c51d6" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days            = 7 -> null
      - description                        = "Custom KMS Key for ndr-dev_PostDocumentReferencesFHIR" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "02fc5ef7-5064-451a-8cdd-3b7e836c51d6" -> null
      - is_enabled                         = true -> null
      - key_id                             = "02fc5ef7-5064-451a-8cdd-3b7e836c51d6" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:root"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowRootAccountAccess"
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "[REDACTED_IAM_ROLE_ARN]"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowLambdaExecutionRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - rotation_period_in_days            = 365 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Environment" = "dev"
          - "Owner"       = "nhse/ndr-team"
          - "Workspace"   = "ndr-dev"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.search-document-references-fhir-lambda.aws_api_gateway_integration.lambda_integration["0"] must be replaced
-/+ resource "aws_api_gateway_integration" "lambda_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "hh83vc" -> (known after apply)
      ~ id                      = "agi-ccy0v3rve9-hh83vc-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "hh83vc" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

Plan: 10 to add, 7 to change, 22 to destroy.
```

</details>